lectures/lecture_template.org
#+TITLE:  Notions de patrons de fonctions et de classes
#+AUTHOR: Xavier Garrido
#+DATE:   02/10/2013
#+OPTIONS: toc:nil ^:{}
#+LATEX_HEADER: \setcounter{chapter}{9}

Nous avons vu que la surdéfinition de fonctions permettait de donner un nom
unique à plusieurs fonctions réalisant un travail différent. La notion de
"patron" de fonction (/template/ en anglais) est à la fois plus puissante et
plus restrictive; plus puissante car il suffit d'écrire une seule fois la
définition d'une fonction pour que le compilateur puisse automatiquement
l'adapter à n'importe quel type; plus restrictive car cela suppose alors que
l'ensemble des fonctions ainsi définies corresponde à la même définition, donc
au même algorithme. Dans ce cadre, les notions de surdéfinition de fonction et
de patron de fonctions répondent chacune à un besoin différent.

