doc/lectures/lecture_template.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Notions de patrons de fonctions et de classes</title>
<!-- 2013-10-19 sam. 16:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="lecture_pointeur.html">Pointeurs, références & allocation dynamique </a><a href="lecture_fonction.html">Rappels sur les fonctions </a><a href="lecture_specificite_c++.html">Les spécificités du C++ </a><a href="lecture_struct_class.html">Structures et classes </a><aa>Encapsulation des données </aa><aa>Notions de constructeur et de destructeur </aa><aa>Fonctions et classes amies </aa><aa>Surcharge d'opérateur </aa><aa>Héritage </aa><aa>Notions de patrons de fonctions et de classes </aa><aa>Introduction à la librairie standard STL </aa><a href=""></a><hr/><a href="annexe_compilation.html">Compilation et directives de préprocesseur </a><a href="annexe_convention_ecriture.html">Convention d'écriture et organisation des programmes </a><a href="annexe_cout_cin.html">Écriture/lecture sur l'entrée/sortie standard </a><aa>Les membres données statiques </aa><aa>Utilisation de enum et de typedef </aa>
                    <hr/>
                    <a href="../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Notions de patrons de fonctions et de classes</h1><hr/>
<p>
Nous avons vu que la surdéfinition de fonctions permettait de donner un nom
unique à plusieurs fonctions réalisant un travail différent. La notion de
&ldquo;patron&rdquo; de fonction (<i>template</i> en anglais) est à la fois plus puissante et
plus restrictive; plus puissante car il suffit d&rsquo;écrire une seule fois la
définition d&rsquo;une fonction pour que le compilateur puisse automatiquement
l&rsquo;adapter à n&rsquo;importe quel type; plus restrictive car cela suppose alors que
l&rsquo;ensemble des fonctions ainsi définies corresponde à la même définition, donc
au même algorithme. Dans ce cadre, les notions de surdéfinition de fonction et
de patron de fonctions répondent chacune à un besoin différent.
</p>
