lectures/lecture_template.org
* Les patrons de fonction

Pour tenter d'illustrer l'intérêt des patrons de fonctions et leurs différences
vis-à-vis de la surdéfinition de fonction, considérons le cas scolaire de la
recherche du minimum de deux valeurs. Du point de vue de la surdéfinition de
fonction, il s'agit d'écrire une fonction =min= pour chaque type de variable
rencontrée, soit

#+BEGIN_SRC c++
  int min (const int a, const int b)
  {
    return a < b ? a : b;
  }

  float min (const float a, const float b)
  {
    return a < b ? a : b;
  }

  char min (const char a, const char b)
  {
    return a < b ? a : b;
  }
#+END_SRC

Selon le contexte c'est-à-dire suivant le type d'argument fourni lors de l'appel
de la fonction =min=, le compilateur se chargera d'utiliser la fonction
adéquat. Toutefois, l'ensemble de ces définitions réalise la même opération et
d'autre part, il devient nécessaire à l'auteur de la fonction, de considérer
l'ensemble des types possibles et imaginables. Pour simplifer considérablement
les choses, le \Cpp permet l'utilisation de *patrons de fonctions* afin de
généraliser la définition de fonctions. Ainsi, l'ensemble des cas susceptibles
d'être rencontrés par la surdéfinition de fonctions peut se résumer à la
déclaration suivante

#+BEGIN_SRC c++
  template<class T> T min (const T a, const T b)
  {
    return a < b ? a : b;
  }
#+END_SRC

Seul l'entête a changé, le corps de la fonction étant nécessairement indépendant
du type de paramètres[fn:1] fournis. Ainsi la précédente déclaration précise que
l'on est en présence d'un patron (=template=) dans lequel apparaît un
"paramètre" de type désigné par la lettre =T=. En d'autres termes, dans la
définition de la fonction =min=, =T= représente un type quelconque à la fois
type de retour de la fonction mais également argument de cette dernière.

Pour utiliser le patron =min= précédemment crée, il suffit d'utiliser la
fonction =min= dans des conditions appropriées (dans notre cas, en fournissant
deux arguments de même type). Le code suivant illustre quelques appels de cette
fonction

#+BEGIN_SRC c++
  int main ()
  {
    const int i1 = 2, i2 = 7;
    const float f1 = 3.4, f2 = 5.6;
    const char c1 = 'd', c2 = 'z';

    cout << "min(" << i1 << "," << i2 << ") = " << min (i1,i2) << endl;
    cout << "min(" << f1 << "," << f2 << ") = " << min (f1,f2) << endl;
    cout << "min(" << c1 << "," << c2 << ") = " << min (c1,c2) << endl;
    cout << "min(&c1,&c2) = " << min (&c1,&c2) << endl;
  }
#+END_SRC

Dans le premier cas où les arguments sont de type =int=, le compilateur
"enregistrera" /i.e./ fabriquera automatiquement la fonction =min= dite fonction
patron correspondant à des arguments de type entier. De même, pour des arguments
de type =float= ou un caractère.

S'il n'est plus nécessaire de définir une implémentation par type de données, le
compilateur doit cependant disposer de la définition du patron afin de
déterminer quelle fonction enregistrer. Aussi, la définition doit nécessairement
intervenir avant une quelconque utilisation de la fonction. D'autre part, cette
généralisation dans l'écriture de fonctions s'applique également aux classes
moyennant la surcharge des opérateurs mis en jeu (ici, l'opérateur =<=). Il est
parfaitement envisageable d'appeler la fonction =min= avec comme argument la
désormais célèbre classe =Point=, sous réserve que l'opérateur d'infériorité =<=
soit surchargé. Ainsi, le programme suivant demeure valable

#+BEGIN_SRC c++
  class Point
  {
  public:
    Point(const unsigned int abs = 0,
          const unsigned int ord = 0) : m_X(abs), m_Y(ord) {}

    unsigned int GetNorme() const { return m_X*m_X+m_Y*m_Y; }
    friend bool operator<(const Point& p1, const Point& p2);
  private:
    unsigned int m_X;
    unsigned int m_Y;
  };

  bool operator<(const Point& p1, const Point& p2)
  {
    return p1.GetNorme() < p2.GetNorme();
  }

  int main()
  {
    Point myPoint1(3,4), myPoint2(5,2);
    Point myPoint3 = min(myPoint1,myPoint2);
  }
#+END_SRC

Le couplage entre patron de fonctions et surcharge d'opérateur constitue donc un
outil puissant qui permet d'obtenir une forme "d'abstraction" en
s'affranchissant des problèmes de type.

