doc/lectures/lecture_template.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Les patrons de fonction</h2>
<div class="outline-text-2" id="text-1">
<p>
Pour tenter d&rsquo;illustrer l&rsquo;intérêt des patrons de fonctions et leurs différences
vis-à-vis de la surdéfinition de fonction, considérons le cas scolaire de la
recherche du minimum de deux valeurs. Du point de vue de la surdéfinition de
fonction, il s&rsquo;agit d&rsquo;écrire une fonction <code>min</code> pour chaque type de variable
rencontrée, soit
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-function-name">min</span> (<span class="org-keyword">const</span> <span class="org-type">int</span> <span class="org-variable-name">a</span>, <span class="org-keyword">const</span> <span class="org-type">int</span> <span class="org-variable-name">b</span>)
{
  <span class="org-keyword">return</span> a &lt; b ? a : b;
}

<span class="org-type">float</span> <span class="org-function-name">min</span> (<span class="org-keyword">const</span> <span class="org-type">float</span> <span class="org-variable-name">a</span>, <span class="org-keyword">const</span> <span class="org-type">float</span> <span class="org-variable-name">b</span>)
{
  <span class="org-keyword">return</span> a &lt; b ? a : b;
}

<span class="org-type">char</span> <span class="org-function-name">min</span> (<span class="org-keyword">const</span> <span class="org-type">char</span> <span class="org-variable-name">a</span>, <span class="org-keyword">const</span> <span class="org-type">char</span> <span class="org-variable-name">b</span>)
{
  <span class="org-keyword">return</span> a &lt; b ? a : b;
}
</pre>
</div>

<p>
Selon le contexte c&rsquo;est-à-dire suivant le type d&rsquo;argument fourni lors de l&rsquo;appel
de la fonction <code>min</code>, le compilateur se chargera d&rsquo;utiliser la fonction
adéquat. Toutefois, l&rsquo;ensemble de ces définitions réalise la même opération et
d&rsquo;autre part, il devient nécessaire à l&rsquo;auteur de la fonction, de considérer
l&rsquo;ensemble des types possibles et imaginables. Pour simplifer considérablement
les choses, le C++ permet l&rsquo;utilisation de <b>patrons de fonctions</b> afin de
généraliser la définition de fonctions. Ainsi, l&rsquo;ensemble des cas susceptibles
d&rsquo;être rencontrés par la surdéfinition de fonctions peut se résumer à la
déclaration suivante
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">class</span> <span class="org-type">T</span>&gt; <span class="org-type">T</span> <span class="org-function-name">min</span> (<span class="org-keyword">const</span> <span class="org-type">T</span> <span class="org-variable-name">a</span>, <span class="org-keyword">const</span> <span class="org-type">T</span> <span class="org-variable-name">b</span>)
{
  <span class="org-keyword">return</span> a &lt; b ? a : b;
}
</pre>
</div>

<p>
Seul l&rsquo;entête a changé, le corps de la fonction étant nécessairement indépendant
du type de paramètres<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> fournis. Ainsi la précédente déclaration précise que
l&rsquo;on est en présence d&rsquo;un patron (<code>template</code>) dans lequel apparaît un
&ldquo;paramètre&rdquo; de type désigné par la lettre <code>T</code>. En d&rsquo;autres termes, dans la
définition de la fonction <code>min</code>, <code>T</code> représente un type quelconque à la fois
type de retour de la fonction mais également argument de cette dernière.
</p>

<p>
Pour utiliser le patron <code>min</code> précédemment crée, il suffit d&rsquo;utiliser la
fonction <code>min</code> dans des conditions appropriées (dans notre cas, en fournissant
deux arguments de même type). Le code suivant illustre quelques appels de cette
fonction
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-function-name">main</span> ()
{
  <span class="org-keyword">const</span> <span class="org-type">int</span> <span class="org-variable-name">i1</span> = 2, <span class="org-variable-name">i2</span> = 7;
  <span class="org-keyword">const</span> <span class="org-type">float</span> <span class="org-variable-name">f1</span> = 3.4, <span class="org-variable-name">f2</span> = 5.6;
  <span class="org-keyword">const</span> <span class="org-type">char</span> <span class="org-variable-name">c1</span> = <span class="org-string">'d'</span>, <span class="org-variable-name">c2</span> = <span class="org-string">'z'</span>;

  cout &lt;&lt; <span class="org-string">"min("</span> &lt;&lt; i1 &lt;&lt; <span class="org-string">","</span> &lt;&lt; i2 &lt;&lt; <span class="org-string">") = "</span> &lt;&lt; min (i1,i2) &lt;&lt; endl;
  cout &lt;&lt; <span class="org-string">"min("</span> &lt;&lt; f1 &lt;&lt; <span class="org-string">","</span> &lt;&lt; f2 &lt;&lt; <span class="org-string">") = "</span> &lt;&lt; min (f1,f2) &lt;&lt; endl;
  cout &lt;&lt; <span class="org-string">"min("</span> &lt;&lt; c1 &lt;&lt; <span class="org-string">","</span> &lt;&lt; c2 &lt;&lt; <span class="org-string">") = "</span> &lt;&lt; min (c1,c2) &lt;&lt; endl;
  cout &lt;&lt; <span class="org-string">"min(&amp;c1,&amp;c2) = "</span> &lt;&lt; min (&amp;c1,&amp;c2) &lt;&lt; endl;
}
</pre>
</div>

<p>
Dans le premier cas où les arguments sont de type <code>int</code>, le compilateur
&ldquo;enregistrera&rdquo; <i>i.e.</i> fabriquera automatiquement la fonction <code>min</code> dite fonction
patron correspondant à des arguments de type entier. De même, pour des arguments
de type <code>float</code> ou un caractère.
</p>

<p>
S&rsquo;il n&rsquo;est plus nécessaire de définir une implémentation par type de données, le
compilateur doit cependant disposer de la définition du patron afin de
déterminer quelle fonction enregistrer. Aussi, la définition doit nécessairement
intervenir avant une quelconque utilisation de la fonction. D&rsquo;autre part, cette
généralisation dans l&rsquo;écriture de fonctions s&rsquo;applique également aux classes
moyennant la surcharge des opérateurs mis en jeu (ici, l&rsquo;opérateur <code>&lt;</code>). Il est
parfaitement envisageable d&rsquo;appeler la fonction <code>min</code> avec comme argument la
désormais célèbre classe <code>Point</code>, sous réserve que l&rsquo;opérateur d&rsquo;infériorité <code>&lt;</code>
soit surchargé. Ainsi, le programme suivant demeure valable
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">Point</span>
{
<span class="org-keyword">public</span>:
  <span class="org-function-name">Point</span>(<span class="org-keyword">const</span> <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">abs</span> = 0,
        <span class="org-keyword">const</span> <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">ord</span> = 0) : m_X(abs), m_Y(ord) {}

  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-function-name">GetNorme</span>() <span class="org-keyword">const</span> { <span class="org-keyword">return</span> m_X*m_X+m_Y*m_Y; }
  <span class="org-keyword">friend</span> <span class="org-type">bool</span> <span class="org-keyword">operator</span><span class="org-function-name">&lt;</span>(<span class="org-keyword">const</span> <span class="org-type">Point</span>&amp; <span class="org-variable-name">p1</span>, <span class="org-keyword">const</span> <span class="org-type">Point</span>&amp; <span class="org-variable-name">p2</span>);
<span class="org-keyword">private</span>:
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">m_X</span>;
  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">m_Y</span>;
};

<span class="org-type">bool</span> <span class="org-keyword">operator</span><span class="org-function-name">&lt;</span>(<span class="org-keyword">const</span> <span class="org-type">Point</span>&amp; <span class="org-variable-name">p1</span>, <span class="org-keyword">const</span> <span class="org-type">Point</span>&amp; <span class="org-variable-name">p2</span>)
{
  <span class="org-keyword">return</span> p1.GetNorme() &lt; p2.GetNorme();
}

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">Point</span> <span class="org-variable-name">myPoint1</span>(3,4), <span class="org-variable-name">myPoint2</span>(5,2);
  <span class="org-type">Point</span> <span class="org-variable-name">myPoint3</span> = min(myPoint1,myPoint2);
}
</pre>
</div>

<p>
Le couplage entre patron de fonctions et surcharge d&rsquo;opérateur constitue donc un
outil puissant qui permet d&rsquo;obtenir une forme &ldquo;d&rsquo;abstraction&rdquo; en
s&rsquo;affranchissant des problèmes de type.
</p>
</div>
