lectures/lecture_template.org
*** Remarques

- Le mécanisme même des patrons fait que ces instructions sont utilisées par le
  compilateur pour enregistrer chaque fois qu'il est nécessaire, les
  instructions correspondant à la fonction requise. La définition de patron ne
  peut donc intervenir dans un module objet (fichiers =.cc,.cpp=,...)
  indépendant de l'utilisation qui en sera faite. Dans la pratique, les
  définitions de patrons se situent donc dans un fichier d'entête de telle sorte
  à être "en ligne"[fn:2]

- Un patron de fonctions peut comporter un ou
  plusieurs paramètres de type, chacun devant être précédé du mot clé
  =class= :
  #+BEGIN_SRC c++
    template<class T, class U...> void fct(T t, U u, ...)
  #+END_SRC
  Dans tous les cas, il est nécessaire que chaque paramètre de type
  apparaisse au moins une fois dans l'entête du patron.

- Dans l'hypothèse où la fonction =min= est appelée avec des arguments de type
  différents (=char= et =int=, par exemple), il y aura une erreur de compilation
  du fait que le \Cpp impose une correspondance absolue des types. Il est
  cependant possible d'intervenir sur ce mécanisme d'identification de type, en
  imposant le type des arguments lors de l'appel de la fonction. Ainsi, les
  instructions suivantes sont toutes valables
  #+BEGIN_SRC c++
    unsigned int i1 = 2;
    int i2 = 3;
    char c1 = 'c';
    // Force l'utilisation de min<int> en imposant la conversion
    // de c en int, le résultat étant une valeur entière
    cout << "min(" << c1 << "," << i2 << ") = "
         << min<int>(c1, i2) << endl;

    // Force l'utilisation de min<int> en imposant la conversion
    // de i1 en int, le résultat étant une valeur entière
    cout << "min(" << i1 << "," << i2 << ") = "
         << min<int>(i1, i2) << endl;

    // Force l'utilisation de min<char> en imposant la conversion
    // de i1 et i2 en char, le résultat étant un caractère
    cout << "min(" << i1 << "," << i2 << ") = "
         << min<char>(i1,i2) << endl;
  #+END_SRC

