doc/lectures/lecture_template.html

<div id="outline-container-sec-1-0-1" class="outline-4">
<h4 id="sec-1-0-1">Remarques</h4>
<div class="outline-text-4" id="text-1-0-1">
<ul class="org-ul">
<li>Le mécanisme même des patrons fait que ces instructions sont utilisées par le
compilateur pour enregistrer chaque fois qu&rsquo;il est nécessaire, les
instructions correspondant à la fonction requise. La définition de patron ne
peut donc intervenir dans un module objet (fichiers <code>.cc,.cpp</code>,&#x2026;)
indépendant de l&rsquo;utilisation qui en sera faite. Dans la pratique, les
définitions de patrons se situent donc dans un fichier d&rsquo;entête de telle sorte
à être &ldquo;en ligne"<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>
</li>

<li>Un patron de fonctions peut comporter un ou
plusieurs paramètres de type, chacun devant être précédé du mot clé
<code>class</code> :
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">class</span> <span class="org-type">T</span>, <span class="org-keyword">class</span> <span class="org-type">U</span>...&gt; <span class="org-type">void</span> <span class="org-function-name">fct</span>(<span class="org-type">T</span> <span class="org-variable-name">t</span>, <span class="org-type">U</span> <span class="org-variable-name">u</span>, ...)
</pre>
</div>
<p>
Dans tous les cas, il est nécessaire que chaque paramètre de type
apparaisse au moins une fois dans l&rsquo;entête du patron.
</p>
</li>

<li>Dans l&rsquo;hypothèse où la fonction <code>min</code> est appelée avec des arguments de type
différents (<code>char</code> et <code>int</code>, par exemple), il y aura une erreur de compilation
du fait que le C++ impose une correspondance absolue des types. Il est
cependant possible d&rsquo;intervenir sur ce mécanisme d&rsquo;identification de type, en
imposant le type des arguments lors de l&rsquo;appel de la fonction. Ainsi, les
instructions suivantes sont toutes valables
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">i1</span> = 2;
<span class="org-type">int</span> <span class="org-variable-name">i2</span> = 3;
<span class="org-type">char</span> <span class="org-variable-name">c1</span> = <span class="org-string">'c'</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">Force l'utilisation de min&lt;int&gt; en imposant la conversion</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">de c en int, le r&#233;sultat &#233;tant une valeur enti&#232;re</span>
cout &lt;&lt; <span class="org-string">"min("</span> &lt;&lt; c1 &lt;&lt; <span class="org-string">","</span> &lt;&lt; i2 &lt;&lt; <span class="org-string">") = "</span>
     &lt;&lt; <span class="org-type">min</span>&lt;<span class="org-type">int</span>&gt;(c1, i2) &lt;&lt; endl;

<span class="org-comment-delimiter">// </span><span class="org-comment">Force l'utilisation de min&lt;int&gt; en imposant la conversion</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">de i1 en int, le r&#233;sultat &#233;tant une valeur enti&#232;re</span>
cout &lt;&lt; <span class="org-string">"min("</span> &lt;&lt; i1 &lt;&lt; <span class="org-string">","</span> &lt;&lt; i2 &lt;&lt; <span class="org-string">") = "</span>
     &lt;&lt; <span class="org-type">min</span>&lt;<span class="org-type">int</span>&gt;(i1, i2) &lt;&lt; endl;

<span class="org-comment-delimiter">// </span><span class="org-comment">Force l'utilisation de min&lt;char&gt; en imposant la conversion</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">de i1 et i2 en char, le r&#233;sultat &#233;tant un caract&#232;re</span>
cout &lt;&lt; <span class="org-string">"min("</span> &lt;&lt; i1 &lt;&lt; <span class="org-string">","</span> &lt;&lt; i2 &lt;&lt; <span class="org-string">") = "</span>
     &lt;&lt; <span class="org-type">min</span>&lt;<span class="org-type">char</span>&gt;(i1,i2) &lt;&lt; endl;
</pre>
</div>
</li>
</ul>
</div>
</div>
</div>
