lectures/lecture_template.org
* Les patrons de classe

Le précédent paragraphe a montré comment \Cpp permettait, grâce à la notion de
patron de fonction, de définir une famille de fonctions paramétrées par un ou
plusieurs types. D'une manière comparable, \Cpp permet de définir des "patrons
de classe" afin de définir une seule et unique fois la classe pour que le
compilateur puisse automatiquement l'adapter à différents types. Ce mécanisme
évite ainsi de définir plusieurs classes similaires pour décrire un même concept
appliqué à plusieurs types de données différents. Cette notion est largement
utilisée pour définir tous les types de "containers" (comme les listes, les
tables, les piles, etc.), mais également d'algorithmes génériques tels que ceux
de la bibliothèque standard.

La syntaxe permettant de définir un patron de classe est similaire à celle qui
permet de définir des patrons de fonctions. Un exemple de classe template,
portant sur la structure =Point= pour laquelle la précision de représentation
(entiers, entiers non signés, réels,...) est le paramètre type de la classe, est

#+BEGIN_SRC c++
  template<class T> class Point
  {
  public:
    Point(T abs = 0, T ord = 0) : m_X(abs), m_Y(ord) {}
    void Affiche();
  private:
    T m_X;
    T m_Y;
  };
#+END_SRC

Pour complèter la définition de notre patron de classe, il convient de définir
les méthodes. Selon que l'on souhaite définir la méthode en ligne (/i.e./ à
l'intérieur de la définition du patron de classe) ou non, la démarche est
sensiblement différente. Dans le cas de la définition en ligne telle le
constructeur =Point(T abs = 0, T ord = 0)=, l'utilisation demeure naturelle, la
seule contrainte tenant à l'emploi du paramètre de type =T=. En revanche,
lorsque la méthode est définie en dehors, il est impératif de rappeler au
compilateur :

- que, dans la définition de cette fonction, vont apparaître des paramètres de
  type. On fournit donc la liste de paramètre sous la forme =template<class T>=,

- le nom du patron concerné. Par exemple, si nous définissons la méthode
  =Affiche=, son nom sera =Point<T>::Affiche()=.

Ainsi, la méthode =Affiche= serait définie de la façon suivante
#+BEGIN_SRC c++
  template<class T> void Point<T>::Affiche()
  {
    cout << "Coordonnées : " << m_X << " " << m_Y << endl;
  }
#+END_SRC

L'utilisation de patron de classe est similaire à celle des patrons de fonctions
à ceci près qu'il est nécessaire d'imposer le paramètre de type lors de
l'instanciation de la classe. Aussi après avoir crée le patron de classe
=Point=, la déclaration d'instances de =Point= est
#+BEGIN_SRC c++
  Point<int> myPointWithInteger;
  Point<double> myPointWithDouble(3.2,4.5);
#+END_SRC

Les contraintes d'utilisation de patron de classe sont du même ordre que celles
inhérentes à l'utilisation des patrons de fonctions : les recommendations issues
du premier paragraphe de cette fiche sont donc également applicables aux patrons
de classe. La principale d'entre elles tient à la définition de la classe et de
ses méthodes qui est indispensable au compilateur pour enregistrer chaque fois
que nécessaire les instructions requises. En pratique, on placera donc les
définitions de patron dans un fichier d'entête approprié.

Il est également envisageable de fournir un nombre quelconque de paramètre de
type dans la définition du patron de classe de même que des paramètres
expressions. L'exemple ci-dessous illustre ces cas
#+BEGIN_SRC c++
  template<class T, class U, unsigned int n> class Tableau
  {
    T m_Tab[n];
    U m_Mean;

  public:
    Tableau() {}
    T& operator[](const unsigned int i) const { return m_Tab[i]; }
    U GetMean() const { return m_Mean; }
  };

  int main()
  {
    Tableau<int, float, 5> myTableau1;
    Tableau<float, float, 10> myTableau2;
    Tableau<Point<int>, Point<float>, 6> myTableau3;
  }
#+END_SRC

Par ailleurs, il n'est pas possible de surdéfinir un patron de classe
c'est-à-dire de créer plusieurs patrons de même nom mais comportant une liste de
paramètres (de type ou d'expression) différent et ce contrairement aux patrons
de fonctions. En conséquence, les ambiguïtés évoquées lors de l'instanciation
d'une classe fonction ne peuvent plus se poser dans le cas de l'instanciation
d'une classe patron.


* Footnotes

[fn:1] dans le cadre des patrons de fonctions et de classes, on parle
communément de paramètres et non d'argument. D'autre part, le \Cpp a décidé
d'employer le mot clé =class= pour préciser que =T= est un paramètre de
type. Pour lever cette ambiguïté, les compilateurs récents ont introduit le mot
clé =typename= qui peut se substituer au mot clé =class=. Cependant, son
utilisation est peu répandue.

[fn:2] les compilateurs récents permettent l'usage du mot clé =export= lors de
la définition d'un patron =export template<class T> T min(T a, T b) {...}=. On
peut alors utiliser ce patron depuis un autre fichier source, en se contentant
de mentionner sa "déclaration".
