doc/lectures/lecture_template.html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Les patrons de classe</h2>
<div class="outline-text-2" id="text-2">
<p>
Le précédent paragraphe a montré comment C++ permettait, grâce à la notion de
patron de fonction, de définir une famille de fonctions paramétrées par un ou
plusieurs types. D&rsquo;une manière comparable, C++ permet de définir des &ldquo;patrons
de classe&rdquo; afin de définir une seule et unique fois la classe pour que le
compilateur puisse automatiquement l&rsquo;adapter à différents types. Ce mécanisme
évite ainsi de définir plusieurs classes similaires pour décrire un même concept
appliqué à plusieurs types de données différents. Cette notion est largement
utilisée pour définir tous les types de &ldquo;containers&rdquo; (comme les listes, les
tables, les piles, etc.), mais également d&rsquo;algorithmes génériques tels que ceux
de la bibliothèque standard.
</p>

<p>
La syntaxe permettant de définir un patron de classe est similaire à celle qui
permet de définir des patrons de fonctions. Un exemple de classe template,
portant sur la structure <code>Point</code> pour laquelle la précision de représentation
(entiers, entiers non signés, réels,&#x2026;) est le paramètre type de la classe, est
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">class</span> <span class="org-type">T</span>&gt; <span class="org-keyword">class</span> <span class="org-type">Point</span>
{
<span class="org-keyword">public</span>:
  <span class="org-function-name">Point</span>(<span class="org-type">T</span> <span class="org-variable-name">abs</span> = 0, <span class="org-type">T</span> <span class="org-variable-name">ord</span> = 0) : m_X(abs), m_Y(ord) {}
  <span class="org-type">void</span> <span class="org-function-name">Affiche</span>();
<span class="org-keyword">private</span>:
  <span class="org-type">T</span> <span class="org-variable-name">m_X</span>;
  <span class="org-type">T</span> <span class="org-variable-name">m_Y</span>;
};
</pre>
</div>

<p>
Pour complèter la définition de notre patron de classe, il convient de définir
les méthodes. Selon que l&rsquo;on souhaite définir la méthode en ligne (<i>i.e.</i> à
l&rsquo;intérieur de la définition du patron de classe) ou non, la démarche est
sensiblement différente. Dans le cas de la définition en ligne telle le
constructeur <code>Point(T abs = 0, T ord = 0)</code>, l&rsquo;utilisation demeure naturelle, la
seule contrainte tenant à l&rsquo;emploi du paramètre de type <code>T</code>. En revanche,
lorsque la méthode est définie en dehors, il est impératif de rappeler au
compilateur :
</p>

<ul class="org-ul">
<li>que, dans la définition de cette fonction, vont apparaître des paramètres de
type. On fournit donc la liste de paramètre sous la forme <code>template&lt;class T&gt;</code>,
</li>

<li>le nom du patron concerné. Par exemple, si nous définissons la méthode
  <code>Affiche</code>, son nom sera <code>Point&lt;T&gt;::Affiche()</code>.
</li>
</ul>

<p>
Ainsi, la méthode <code>Affiche</code> serait définie de la façon suivante
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">class</span> <span class="org-type">T</span>&gt; <span class="org-type">void</span> <span class="org-constant">Point</span>&lt;<span class="org-type">T</span>&gt;::<span class="org-function-name">Affiche</span>()
{
  cout &lt;&lt; <span class="org-string">"Coordonn&#233;es : "</span> &lt;&lt; m_X &lt;&lt; <span class="org-string">" "</span> &lt;&lt; m_Y &lt;&lt; endl;
}
</pre>
</div>

<p>
L&rsquo;utilisation de patron de classe est similaire à celle des patrons de fonctions
à ceci près qu&rsquo;il est nécessaire d&rsquo;imposer le paramètre de type lors de
l&rsquo;instanciation de la classe. Aussi après avoir crée le patron de classe
<code>Point</code>, la déclaration d&rsquo;instances de <code>Point</code> est
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">Point</span>&lt;<span class="org-type">int</span>&gt; <span class="org-variable-name">myPointWithInteger</span>;
<span class="org-type">Point</span>&lt;<span class="org-type">double</span>&gt; <span class="org-function-name">myPointWithDouble</span>(3.2,4.5);
</pre>
</div>

<p>
Les contraintes d&rsquo;utilisation de patron de classe sont du même ordre que celles
inhérentes à l&rsquo;utilisation des patrons de fonctions : les recommendations issues
du premier paragraphe de cette fiche sont donc également applicables aux patrons
de classe. La principale d&rsquo;entre elles tient à la définition de la classe et de
ses méthodes qui est indispensable au compilateur pour enregistrer chaque fois
que nécessaire les instructions requises. En pratique, on placera donc les
définitions de patron dans un fichier d&rsquo;entête approprié.
</p>

<p>
Il est également envisageable de fournir un nombre quelconque de paramètre de
type dans la définition du patron de classe de même que des paramètres
expressions. L&rsquo;exemple ci-dessous illustre ces cas
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">template</span>&lt;<span class="org-keyword">class</span> <span class="org-type">T</span>, <span class="org-keyword">class</span> <span class="org-type">U</span>, <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">n</span>&gt; <span class="org-keyword">class</span> <span class="org-type">Tableau</span>
{
  <span class="org-type">T</span> <span class="org-variable-name">m_Tab</span>[n];
  <span class="org-type">U</span> <span class="org-variable-name">m_Mean</span>;

<span class="org-keyword">public</span>:
  <span class="org-function-name">Tableau</span>() {}
  <span class="org-type">T</span>&amp; <span class="org-keyword">operator</span><span class="org-function-name">[]</span>(<span class="org-keyword">const</span> <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">i</span>) <span class="org-keyword">const</span> { <span class="org-keyword">return</span> m_Tab[i]; }
  <span class="org-type">U</span> <span class="org-function-name">GetMean</span>() <span class="org-keyword">const</span> { <span class="org-keyword">return</span> m_Mean; }
};

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">Tableau</span>&lt;<span class="org-type">int</span>, <span class="org-type">float</span>, 5&gt; <span class="org-variable-name">myTableau1</span>;
  <span class="org-type">Tableau</span>&lt;<span class="org-type">float</span>, <span class="org-type">float</span>, 10&gt; <span class="org-variable-name">myTableau2</span>;
  <span class="org-type">Tableau</span>&lt;<span class="org-type">Point</span>&lt;<span class="org-type">int</span>&gt;, <span class="org-type">Point</span>&lt;<span class="org-type">float</span>&gt;, 6&gt; <span class="org-variable-name">myTableau3</span>;
}
</pre>
</div>

<p>
Par ailleurs, il n&rsquo;est pas possible de surdéfinir un patron de classe
c&rsquo;est-à-dire de créer plusieurs patrons de même nom mais comportant une liste de
paramètres (de type ou d&rsquo;expression) différent et ce contrairement aux patrons
de fonctions. En conséquence, les ambiguïtés évoquées lors de l&rsquo;instanciation
d&rsquo;une classe fonction ne peuvent plus se poser dans le cas de l&rsquo;instanciation
d&rsquo;une classe patron.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
dans le cadre des patrons de fonctions et de classes, on parle
communément de paramètres et non d&rsquo;argument. D&rsquo;autre part, le C++ a décidé
d&rsquo;employer le mot clé <code>class</code> pour préciser que <code>T</code> est un paramètre de
type. Pour lever cette ambiguïté, les compilateurs récents ont introduit le mot
clé <code>typename</code> qui peut se substituer au mot clé <code>class</code>. Cependant, son
utilisation est peu répandue.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
les compilateurs récents permettent l&rsquo;usage du mot clé <code>export</code> lors de
la définition d&rsquo;un patron <code>export template&lt;class T&gt; T min(T a, T b) {...}</code>. On
peut alors utiliser ce patron depuis un autre fichier source, en se contentant
de mentionner sa &ldquo;déclaration&rdquo;.
</p></div>


</div>
</div></div>
</body>
</html>
